----------------------------------------------------------------------------------------------------------------------------------------------
        Layer (type)                                      Input Shape                                    Output Shape            Param #    
==============================================================================================================================================
        Embedding-4                                       [[1, 128]]                                     [1, 128, 768]         16,226,304   
        Embedding-5                                       [[1, 128]]                                     [1, 128, 768]           393,216    
        Embedding-6                                       [[1, 128]]                                     [1, 128, 768]            1,536     
        LayerNorm-26                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Dropout-38                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
      BertEmbeddings-2                                        []                                         [1, 128, 768]              0       
         Linear-74                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-75                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-76                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-77                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-13     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-40                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-27                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-78                                      [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-39                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-79                                     [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-41                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-28                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-13                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-80                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-81                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-82                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-83                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-14     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-43                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-29                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-84                                      [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-42                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-85                                     [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-44                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-30                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-14                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-86                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-87                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-88                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-89                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-15     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-46                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-31                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-90                                      [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-45                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-91                                     [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-47                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-32                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-15                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-92                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-93                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-94                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-95                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-16     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-49                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-33                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-96                                      [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-48                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-97                                     [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-50                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-34                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-16                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-98                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-99                                      [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-100                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-101                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-17     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-52                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-35                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-102                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-51                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-103                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-53                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-36                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-17                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-104                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-105                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-106                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-107                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-18     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-55                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-37                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-108                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-54                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-109                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-56                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-38                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-18                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-110                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-111                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-112                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-113                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-19     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-58                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-39                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-114                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-57                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-115                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-59                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-40                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-19                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-116                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-117                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-118                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-119                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-20     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-61                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-41                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-120                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-60                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-121                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-62                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-42                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-20                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-122                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-123                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-124                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-125                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-21     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-64                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-43                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-126                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-63                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-127                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-65                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-44                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-21                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-128                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-129                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-130                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-131                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-22     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-67                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-45                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-132                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-66                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-133                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-68                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-46                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-22                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-134                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-135                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-136                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-137                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-23     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-70                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-47                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-138                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-69                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-139                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-71                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-48                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-23                             [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-140                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-141                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-142                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
         Linear-143                                     [[1, 128, 768]]                                  [1, 128, 768]           590,592    
   MultiHeadAttention-24     [[1, 128, 768], [1, 128, 768], [1, 128, 768], [1, 1, 128, 128], None]       [1, 128, 768]              0       
         Dropout-73                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-49                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
         Linear-144                                     [[1, 128, 768]]                                 [1, 128, 3072]          2,362,368   
         Dropout-72                                    [[1, 128, 3072]]                                 [1, 128, 3072]              0       
         Linear-145                                    [[1, 128, 3072]]                                  [1, 128, 768]          2,360,064   
         Dropout-74                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
        LayerNorm-50                                    [[1, 128, 768]]                                  [1, 128, 768]            1,536     
 TransformerEncoderLayer-24                             [[1, 128, 768]]                                  [1, 128, 768]              0       
    TransformerEncoder-2                                [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-146                                       [[1, 768]]                                       [1, 768]              590,592    
           Tanh-3                                         [[1, 768]]                                       [1, 768]                 0       
        BertPooler-2                                    [[1, 128, 768]]                                    [1, 768]                 0       
        BertModel-2                                       [[1, 128]]                               [[1, 128, 768], [1, 768]]        0       
         Dropout-75                                     [[1, 128, 768]]                                  [1, 128, 768]              0       
         Linear-147                                     [[1, 128, 768]]                                  [1, 128, 128]           98,432     
BertForTokenClassification-1                              [[1, 128]]                                     [1, 128, 128]              0       
==============================================================================================================================================
Total params: 102,366,080
Trainable params: 102,366,080
Non-trainable params: 0
----------------------------------------------------------------------------------------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 178.02
Params size (MB): 390.50
Estimated Total Size (MB): 568.52
----------------------------------------------------------------------------------------------------------------------------------------------

